
#ifndef _GEN_ISA_H_
#define _GEN_ISA_H_

#include <new>

namespace GEN
{
    typedef unsigned __int64 uint64;
    typedef unsigned int     uint32;
    typedef int int32;
    typedef unsigned short   uint16;
    typedef unsigned char    uint8;
    typedef short int16;

    static_assert( sizeof(uint64) == 8, "derp" );
    static_assert( sizeof(uint32) == 4, "derp" );
    static_assert( sizeof(int32)  == 4, "derp" );
    static_assert( sizeof(uint16) == 2, "derp" );
    static_assert( sizeof(int16)  == 2, "derp" );
    static_assert( sizeof(uint8)  == 1, "derp" );


    enum Operations
    {
        OP_ILLEGAL = 0,
        OP_MOV     ,
        OP_SEL     ,
        OP_MOVI    ,
        OP_NOT     ,
        OP_AND     ,
        OP_OR      ,
        OP_XOR     ,
        OP_SHR     ,
        OP_SHL     ,
        OP_DIM     , // double-precision immediate move
        OP_ASR     , // arithmetic right shift
        OP_CMP     , //Component-wise compare, store condition code in destination
        OP_CMPN    , //Component-wise nan, store condition code in destination
        OP_CSEL    , // 3-src conditional select
        OP_F32TO16 ,
        OP_F16TO32 ,
        OP_BFREV   , // bit reverse
        OP_BFE     ,
        OP_BFI1    , // bit-field insert macro-op 1
        OP_BFI2    , // """ 2
        OP_JMPI    , // indexed jump
        OP_BRD     , // diverging branch
        OP_IF      ,
        OP_BRC     , // converging branch
        OP_ELSE    ,
        OP_ENDIF   ,
        OP_CASE    ,
        OP_WHILE   ,
